-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le : sam. 01 oct. 2022 à 04:44
-- Version du serveur : 8.0.27
-- Version de PHP : 8.0.13

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `lolissr`
--

-- --------------------------------------------------------

--
-- Structure de la table `chat`
--

DROP TABLE IF EXISTS `chat`;
CREATE TABLE IF NOT EXISTS `chat` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` text NOT NULL,
  `message` text NOT NULL,
  `avatar` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=184 DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Structure de la table `contact`
--

DROP TABLE IF EXISTS `contact`;
CREATE TABLE IF NOT EXISTS `contact` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `subject` varchar(255) NOT NULL,
  `message` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=101 DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Structure de la table `images`
--

DROP TABLE IF EXISTS `images`;
CREATE TABLE IF NOT EXISTS `images` (
  `id` int NOT NULL AUTO_INCREMENT,
  `nom` varchar(50) NOT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `type` varchar(255) NOT NULL,
  `gender` enum('男','女') NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=131 DEFAULT CHARSET=utf8mb3;

--
-- Déchargement des données de la table `images`
--

INSERT INTO `images` (`id`, `nom`, `date`, `type`, `gender`) VALUES
(1, '1.jpg', '2022-08-01 02:00:00', '原神', '女'),
(2, '2.jpg', '2022-08-01 02:00:00', '原神', '女'),
(11, '11.jpg', '2022-08-01 02:00:00', '原神', '女'),
(12, '12.jpg', '2022-08-01 02:00:00', '原神', '女'),
(3, '3.jpg', '2022-08-01 02:00:00', '原神', '女'),
(4, '4.jpg', '2022-08-01 02:00:00', '原神', '男'),
(5, '5.jpg', '2022-08-01 02:00:00', '原神', '女'),
(6, '6.jpg', '2022-08-01 02:00:00', '原神', '女'),
(7, '7.jpg', '2022-08-01 02:00:00', '原神', '女'),
(8, '8.jpg', '2022-08-01 02:00:00', '原神', '男'),
(9, '9.jpg', '2022-08-01 02:00:00', '原神', '女'),
(10, '10.jpg', '2022-08-01 02:00:00', '原神', '女'),
(13, '13.jpg', '2022-08-01 02:00:00', '原神', '女'),
(14, '14.jpg', '2022-08-01 02:00:00', '原神', '男'),
(15, '15.jpg', '2022-08-01 02:00:00', '原神', '男'),
(16, '16.jpg', '2022-08-01 02:00:00', '原神', '女'),
(17, '17.jpg', '2022-08-01 02:00:00', '原神', '女'),
(18, '18.jpg', '2022-08-01 02:00:00', '原神', '女'),
(19, '19.jpg', '2022-08-01 02:00:00', '原神', '男'),
(20, '20.jpg', '2022-08-01 02:00:00', '原神', '女'),
(21, '21.jpg', '2022-08-01 02:00:00', '原神', '男'),
(22, '22.jpg', '2022-08-01 02:00:00', '原神', '女'),
(23, '23.jpg', '2022-08-01 02:00:00', '原神', '女'),
(31, '31.jpg', '2022-08-01 02:00:00', '原神', '男'),
(32, '32.jpg', '2022-08-01 02:00:00', '原神', '男'),
(33, '33.jpg', '2022-08-01 02:00:00', '原神', '女'),
(34, '34.jpg', '2022-08-01 02:00:00', '原神', '女'),
(35, '35.jpg', '2022-08-01 02:00:00', '原神', '女'),
(36, '36.jpg', '2022-08-01 02:00:00', '原神', '女'),
(37, '37.jpg', '2022-08-01 02:00:00', '原神', '女'),
(38, '38.jpg', '2022-08-01 02:00:00', '原神', '女'),
(39, '39.jpg', '2022-08-01 02:00:00', '原神', '女'),
(40, '40.jpg', '2022-08-01 02:00:00', '原神', '女'),
(41, '41.jpg', '2022-08-01 02:00:00', '崩坏3', '女'),
(42, '42.jpg', '2022-08-01 02:00:00', '崩坏:星穹铁道', '女'),
(43, '43.jpg', '2022-08-01 02:00:00', '崩坏:星穹铁道', '女'),
(44, '44.jpg', '2022-08-01 02:00:00', '崩坏:星穹铁道', '女'),
(45, '45.jpg', '2022-08-01 02:00:00', '崩坏:星穹铁道', '女'),
(46, '46.jpg', '2022-08-01 02:00:00', '崩坏:星穹铁道', '男'),
(47, '47.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(48, '48.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(49, '49.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(50, '50.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(51, '51.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(52, '52.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(53, '53.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(54, '54.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(55, '55.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(56, '56.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(57, '57.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(58, '58.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(24, '24.jpg', '2022-08-01 02:00:00', '原神', '女'),
(25, '25.jpg', '2022-08-01 02:00:00', '原神', '男'),
(26, '26.jpg', '2022-08-01 02:00:00', '原神', '女'),
(27, '27.jpg', '2022-08-01 02:00:00', '原神', '女'),
(28, '28.jpg', '2022-08-01 02:00:00', '原神', '女'),
(29, '29.jpg', '2022-08-01 02:00:00', '原神', '男'),
(30, '30.jpg', '2022-08-01 02:00:00', '原神', '男'),
(59, '59.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(60, '60.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(61, '61.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(62, '62.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(63, '63.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(64, '64.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(65, '65.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(66, '66.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(67, '67.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(68, '68.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(69, '69.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(70, '70.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(71, '71.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(72, '72.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(73, '73.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(74, '74.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(75, '75.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(76, '76.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(77, '77.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(78, '78.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(79, '79.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(80, '80.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(81, '81.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(82, '82.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(83, '83.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(84, '84.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(85, '85.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(86, '86.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(87, '87.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(88, '88.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(89, '89.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(90, '90.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(91, '91.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(92, '92.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(93, '93.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(94, '94.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(95, '95.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(96, '96.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(97, '97.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(98, '98.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(99, '99.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(100, '100.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(101, '101.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(102, '102.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(103, '103.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(104, '104.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(105, '105.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(106, '106.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(107, '107.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(108, '108.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(109, '109.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(110, '110.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(111, '111.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(112, '112.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(113, '113.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(114, '114.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(115, '115.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(116, '116.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(117, '117.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(118, '118.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(119, '119.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(120, '120.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(121, '121.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(122, '122.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(123, '123.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(124, '124.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(125, '125.jpg', '2022-08-01 02:00:00', '明日方舟', '女'),
(126, '126.jpg', '2022-08-01 02:00:00', '明日方舟', '女');

-- --------------------------------------------------------

--
-- Structure de la table `members`
--

DROP TABLE IF EXISTS `members`;
CREATE TABLE IF NOT EXISTS `members` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `sha1` varchar(255) DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `avatar` varchar(255) NOT NULL,
  `role` enum('member','admin') NOT NULL DEFAULT 'member',
  `ban` enum('Y','N') NOT NULL DEFAULT 'N',
  `createdAt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=171 DEFAULT CHARSET=utf8mb3;

--
-- Déchargement des données de la table `members`
--

INSERT INTO `members` (`id`, `name`, `password`, `sha1`, `email`, `avatar`, `role`, `ban`, `createdAt`) VALUES
(110, 'chemin', '$2y$10$nX8I.2yF9qzVn2ourniQEeCm90g8V7EOYIno4Ej4kOBS7/Qn2hmXO', NULL, 'bendev4977@gmail.com', '110.jpeg', 'admin', 'N', '2022-07-23 22:07:02'),
(108, 'azerty1', '$2y$10$PWvvL1nPzotA76.Cq92yZe0U/Z7c89X1mcfpOwCIPuBhCxhYUd2Ee', NULL, 'snowd3w4977@gmail.com', '108.jpeg', 'admin', 'N', '2022-07-23 21:59:23'),
(170, 'compte1', '$2y$10$ys6HIag7h.YVfOKfV.utMeE2muXB9WpH7hcfEXJ/LCPZ4c.O1xIiS', NULL, 'foot12345@gmail.com', 'default.jpg', 'member', 'N', '2022-09-08 18:09:59');

-- --------------------------------------------------------

--
-- Structure de la table `private`
--

DROP TABLE IF EXISTS `private`;
CREATE TABLE IF NOT EXISTS `private` (
  `id` int NOT NULL AUTO_INCREMENT,
  `message` text NOT NULL,
  `id_receipter` int NOT NULL,
  `id_sender` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=222 DEFAULT CHARSET=utf8mb3;

-- --------------------------------------------------------

--
-- Structure de la table `upload`
--

DROP TABLE IF EXISTS `upload`;
CREATE TABLE IF NOT EXISTS `upload` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `size` int NOT NULL,
  `type` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=393 DEFAULT CHARSET=utf8mb3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
